{
  "1410.4303v1": {
    "title": "Digital Investigation of Security Attacks on Cardiac Implantable Medical Devices",
    "authors": [
      "Nourhene Ellouze",
      "Slim Rekhis",
      "Mohamed Allouche",
      "Noureddine Boudriga"
    ],
    "summary": "A Cardiac Implantable Medical device (IMD) is a device, which is surgically\nimplanted into a patient's body, and wirelessly configured using an external\nprogrammer by prescribing physicians and doctors. A set of lethal attacks\ntargeting these devices can be conducted due to the use of vulnerable wireless\ncommunication and security protocols, and the lack of security protection\nmechanisms deployed on IMDs. In this paper, we propose a system for postmortem\nanalysis of lethal attack scenarios targeting cardiac IMDs. Such a system\nreconciles in the same framework conclusions derived by technical investigators\nand deductions generated by pathologists. An inference system integrating a\nlibrary of medical rules is used to automatically infer potential medical\nscenarios that could have led to the death of a patient. A Model Checking based\nformal technique allowing the reconstruction of potential technical attack\nscenarios on the IMD, starting from the collected evidence, is also proposed. A\ncorrelation between the results obtained by the two techniques allows to prove\nwhether a potential attack scenario is the source of the patient's death.",
    "pdf_url": "http://arxiv.org/pdf/1410.4303v1",
    "published": "2014-10-16"
  },
  "1307.8322v1": {
    "title": "Delegation Management Modeling in a Security Policy based Environment",
    "authors": [
      "Ryma Abassi",
      "Sihem Guemara El Fatmi"
    ],
    "summary": "Security Policies (SP) constitute the core of communication networks\nprotection infrastructures. It offers a set of rules allowing differentiating\nbetween legitimate actions and prohibited ones and consequently, associates\neach entity in the network with a set of permissions and privileges. Moreover,\nin today's technological society and to allow applications perpetuity,\ncommunication networks must support the collaboration between entities to face\nup any unavailability or flinching. This collaboration must be governed by\nsecurity mechanisms according to the established permissions and privileges.\nDelegation is a common practice that is used to simplify the sharing of\nresponsibilities and privileges. The delegation process in a SP environment can\nbe implanted through the use of adequate formalisms and modeling. The main\ncontribution of this paper is then, the proposition of a generic and formal\nmodeling of delegation process. This modeling is based on three steps composing\nthe delegation life cycle: negotiation used for delegation initiation,\nverification of the SP respect while delegating and revocation of an\nestablished delegation. Hence, we propose to deal with each step according to\nthe main delegation characteristics and extend them by some new specificities.",
    "pdf_url": "http://arxiv.org/pdf/1307.8322v1",
    "published": "2013-07-31"
  }
}